{"backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "batch_input_shape": [null, 28, 28, 1], "name": "conv2d_1", "data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Conv2D", "config": {"use_bias": true, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_regularizer": null, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 128, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "softmax", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "units": 10, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}